tap "hashicorp/tap" 
tap "olets/tap"
tap "supabase/tap"

# replace basic commands with GNU/Linux version
brew "bash"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "ed"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "iproute2mac"

# utility commands
brew "act"
brew "awscli"
brew "bat"
cask "codex"
brew "direnv"
brew "duti"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "imagemagick"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "kubie"
brew "lima"
brew "mas"
brew "mise"
brew "navi"
brew "neovim"
brew "ripgrep"
brew "stern"
brew "supabase/tap/supabase"
brew "hashicorp/tap/terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "uv"
brew "vercel-cli"
brew "wget"
brew "yq"
brew "zoxide"

# zsh customize
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "olets/tap/zsh-abbr"
brew "starship"
brew "zinit"

# fonts
cask "font-hack-nerd-font"

# CLI applications
cask "1password-cli"
cask "docker"
cask "gcloud-cli"
cask "session-manager-plugin"

# GUI applications
cask "1password"
cask "adobe-creative-cloud"
cask "arc"
cask "chatgpt"
cask "chromium"
cask "claude"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "ghostty@tip"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "obs"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wireshark"
cask "wireshark-app"
cask "zoom"

# App Store applications
mas "LINE", id: 539883307
mas "Whisper Transcription", id: 1668083311
