anseki.vscode-color
azemoh.one-monokai
be5invis.toml
bradlc.vscode-tailwindcss
castwide.solargraph
chflick.firecode
codezombiech.gitignore
cschlosser.doxdocgen
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dfinity-foundation.vscode-motoko
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
figma.figma-vscode-extension
file-icons.file-icons
formulahendry.code-runner
gencer.html-slim-scss-css-class-completion
github.codespaces
github.copilot
github.copilot-chat
github.vscode-pull-request-github
grapecity.gc-excelviewer
heybourn.headwind
hridoy.rails-snippets
humao.rest-client
illixion.vscode-vibrancy-continued
ionutvmi.path-autocomplete
jeff-hykin.better-cpp-syntax
jonkwheeler.styled-components-snippets
josetr.cmake-language-support-vscode
lehni.vscode-fix-checksums
mechatroner.rainbow-csv
michead.vscode-mesh-viewer
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
msjsdiag.vscode-react-native
nash.awesome-flutter-snippets
nativebase.nativebase-v3-vscode-extension
naumovs.color-highlight
pkief.material-icon-theme
prisma.prisma
qiu8310.minapp-vscode
rangav.vscode-thunder-client
rebornix.ruby
rvest.vs-code-prettier-eslint
ryanolsonx.solarized
shanehofstetter.rails-i18n
shd101wyy.markdown-preview-enhanced
sianglim.slim
twxs.cmake
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
